### CustomerData

In [1]:
import pandas as pd
import mysql.connector

In [2]:
df = pd.read_csv("C:\Project_Guvi\Captsone2\DataSet\Customers.csv" , encoding = 'unicode escape')
df.head()

,CustomerKey,Gender,Name,City,State Code,State,Zip Code,Country,Continent,Birthday
0,301,Female,Lilly Harding,WANDEARAH EAST,SA,South Australia,5523,Australia,Australia,7/3/1939
1,325,Female,Madison Hull,MOUNT BUDD,WA,Western Australia,6522,Australia,Australia,9/27/1979
2,554,Female,Claire Ferres,WINJALLOK,VIC,Victoria,3380,Australia,Australia,5/26/1947
3,786,Male,Jai Poltpalingada,MIDDLE RIVER,SA,South Australia,5223,Australia,Australia,9/17/1957
4,1042,Male,Aidan Pankhurst,TAWONGA SOUTH,VIC,Victoria,3698,Australia,Australia,11/19/1965

In [3]:
df.shape

(15266, 10)

In [4]:
df.keys()

Index(['CustomerKey', 'Gender', 'Name', 'City', 'State Code', 'State',
       'Zip Code', 'Country', 'Continent', 'Birthday'],
      dtype='object')

In [5]:
df.isnull().sum()

CustomerKey     0
Gender          0
Name            0
City            0
State Code     10
State           0
Zip Code        0
Country         0
Continent       0
Birthday        0
dtype: int64

In [6]:
df.dtypes

CustomerKey     int64
Gender         object
Name           object
City           object
State Code     object
State          object
Zip Code       object
Country        object
Continent      object
Birthday       object
dtype: object

In [7]:
df = df.drop('State Code' , axis = 1)
df['Birthday'] = pd.to_datetime(df['Birthday'])
df.to_csv("Customers_modified.csv",index = False)

In [15]:
import mysql.connector

# Connect to the MySQL database
mydb = mysql.connector.connect(
    host="localhost",
    user="root",
    password="Deepa@280624",
    database="damm"
)

cursor = mydb.cursor()

# Create the table with correct syntax
cursor.execute('''
    CREATE TABLE customer_data (
        CustomerKey INT,
        Gender TEXT,
        Name TEXT,
        City TEXT,
        State TEXT,
        ZipCode VARCHAR(20),
        Country TEXT,
        Continent TEXT,
        Birthday DATE
    );
''')
customer = pd.read_csv(r"C:\Users\yuvar\Desktop\Captsone2\cleaned_data\Customers_modified.csv")
# Prepare data for insertion (Make sure 'customer' DataFrame is defined)
data = customer[['CustomerKey', 'Gender', 'Name', 'City', 'State', 'Zip Code', 'Country', 'Continent', 'Birthday']].values.tolist()

# Insert data into the table
cursor.executemany('''
    INSERT INTO customer_data (CustomerKey, Gender, Name, City, State, ZipCode, Country, Continent, Birthday) 
    VALUES (%s, %s, %s, %s, %s, %s, %s, %s, %s)
''', data)

# Commit the changes
mydb.commit()

print("Done")

# Close the cursor and connection
cursor.close()
mydb.close()

Done

### ProductData

In [24]:
prd = pd.read_csv("C:\Project_Guvi\Captsone2\DataSet\Products.csv", encoding = 'unicode escape')
prd.head()

,ProductKey,Product Name,Brand,Color,Unit Cost USD,Unit Price USD,SubcategoryKey,Subcategory,CategoryKey,Category
0,1,Contoso 512MB MP3 Player E51 Silver,Contoso,Silver,$6.62,$12.99,101,MP4&MP3,1,Audio
1,2,Contoso 512MB MP3 Player E51 Blue,Contoso,Blue,$6.62,$12.99,101,MP4&MP3,1,Audio
2,3,Contoso 1G MP3 Player E100 White,Contoso,White,$7.40,$14.52,101,MP4&MP3,1,Audio
3,4,Contoso 2G MP3 Player E200 Silver,Contoso,Silver,$11.00,$21.57,101,MP4&MP3,1,Audio
4,5,Contoso 2G MP3 Player E200 Red,Contoso,Red,$11.00,$21.57,101,MP4&MP3,1,Audio

In [25]:
prd.keys()

Index(['ProductKey', 'Product Name', 'Brand', 'Color', 'Unit Cost USD',
       'Unit Price USD', 'SubcategoryKey', 'Subcategory', 'CategoryKey',
       'Category'],
      dtype='object')

In [26]:
prd.isnull().sum()

ProductKey        0
Product Name      0
Brand             0
Color             0
Unit Cost USD     0
Unit Price USD    0
SubcategoryKey    0
Subcategory       0
CategoryKey       0
Category          0
dtype: int64

In [27]:
prd.dtypes

ProductKey         int64
Product Name      object
Brand             object
Color             object
Unit Cost USD     object
Unit Price USD    object
SubcategoryKey     int64
Subcategory       object
CategoryKey        int64
Category          object
dtype: object

In [31]:
prd.shape

(2517, 10)

In [30]:
# Define a function to remove the '$' symbol and the comma separating thousands
def remove_dollar_sign(value):
    return float(value.replace("$", "").replace(",", ""))

# Apply the function to the “Unit Cost USD” column with apply
prd["Unit Cost USD"] = prd["Unit Cost USD"].apply(remove_dollar_sign)
prd["Unit Price USD"] = prd["Unit Price USD"].apply(remove_dollar_sign)

# Show updated columns
prd[["Unit Cost USD", "Unit Price USD"]]

      Unit Cost USD  Unit Price USD
0              6.62           12.99
1              6.62           12.99
2              7.40           14.52
3             11.00           21.57
4             11.00           21.57
...             ...             ...
2512          43.07          129.99
2513          43.07          129.99
2514           1.71            3.35
2515           1.71            3.35
2516           1.71            3.35

[2517 rows x 2 columns]

In [33]:
prd.to_csv('Product_modified.csv', index = False)

In [9]:
import mysql.connector

# Connect to the MySQL database
mydb = mysql.connector.connect(
    host="localhost",
    user="root",
    password="Deepa@280624",
    database="damm"
)

cursor = mydb.cursor()

# Create the table with correct syntax
cursor.execute('''
    CREATE TABLE product_data (
        ProductKey INT,
        ProductName TEXT,
        Brand TEXT,
        Color TEXT,
        UnitCostUSD FLOAT,
        UnitPriceUSD FLOAT,
        SubcategoryKey INT,
        subcategory TEXT,
        CategoryKey INT,
        Category TEXT
    );
''')
product = pd.read_csv(r"C:\Users\yuvar\Desktop\Captsone2\cleaned_data\Product_modified.csv")
# Prepare data for insertion (Make sure 'customer' DataFrame is defined)
data = product[['ProductKey', 'Product Name', 'Brand', 'Color', 'Unit Cost USD', 'Unit Price USD', 'SubcategoryKey', 'Subcategory', 'CategoryKey',
       'Category']].values.tolist()

# Insert data into the table
cursor.executemany('''
    INSERT INTO product_data (	ProductKey,ProductName,Brand,Color,UnitCostUSD,UnitPriceUSD,SubcategoryKey,Subcategory,CategoryKey,Category)
    VALUES (%s, %s, %s, %s, %s, %s, %s, %s, %s,%s)
''', data)

# Commit the changes
mydb.commit()

print("Done")

# Close the cursor and connection
cursor.close()
mydb.close()

Done

### ExchangeRates Data

In [12]:
er = pd.read_csv("C:\Project_Guvi\Captsone2\DataSet\Exchange_Rates.csv",encoding = 'unicode escape')
er.head()

       Date Currency  Exchange
0  1/1/2015      USD    1.0000
1  1/1/2015      CAD    1.1583
2  1/1/2015      AUD    1.2214
3  1/1/2015      EUR    0.8237
4  1/1/2015      GBP    0.6415

In [14]:
er.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11215 entries, 0 to 11214
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      11215 non-null  object
 1   Currency  11215 non-null  object
 2   Exchange  11215 non-null  float64
dtypes: float64(1), object(2)
memory usage: 263.0+ KB

In [16]:
er['Date'] = pd.to_datetime(er['Date'])

In [18]:
er.to_csv('Exchange_modified.csv', index = False)

In [24]:
mydb = mysql.connector.connect(
    host="localhost",
    user="root",
    password="Deepa@280624",
    database="damm"
)
cursor = mydb.cursor()
cursor.execute('''
          create table exchange_data(
               Date Date,
               Currency Text,
               Exchange Float);
               ''')
exchange = pd.read_csv(r"C:\Users\yuvar\Desktop\Captsone2\cleaned_data\Exchange_modified.csv")
data = exchange[['Date' , 'Currency' , 'Exchange']].values.tolist()
cursor.executemany('''
                insert into exchange_data ( Date, Currency , Exchange ) values (%s,%s,%s) ''',data)
mydb.commit()
print("done")
cursor.close()
mydb.close()

done

### Stores Data

In [74]:
st = pd.read_csv("C:\Project_Guvi\Captsone2\DataSet\Stores.csv",encoding = 'unicode escape')
st.head()

   StoreKey    Country                         State  Square Meters  Open Date
0         1  Australia  Australian Capital Territory          595.0   1/1/2008
1         2  Australia            Northern Territory          665.0  1/12/2008
2         3  Australia               South Australia         2000.0   1/7/2012
3         4  Australia                      Tasmania         2000.0   1/1/2010
4         5  Australia                      Victoria         2000.0  12/9/2015

In [76]:
st.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 67 entries, 0 to 66
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   StoreKey       67 non-null     int64
 1   Country        67 non-null     object
 2   State          67 non-null     object
 3   Square Meters  66 non-null     float64
 4   Open Date      67 non-null     object
dtypes: float64(1), int64(1), object(3)
memory usage: 2.7+ KB

In [78]:
st['Open Date'] = pd.to_datetime(st['Open Date'])

In [80]:
avg_sqmeter = round(st['Square Meters'].mean())
avg_sqmeter

1402

In [82]:
st['Square Meters'].fillna(avg_sqmeter, inplace = True)

In [84]:
st.to_csv('Store_modified.csv', index = False)

In [98]:
import mysql.connector
import pandas as pd

mydb = mysql.connector.connect(
    host="localhost",
    user="root",
    password="Deepa@280624",
    database="damm"
)

cursor = mydb.cursor()

# Creating the table with corrected column names
cursor.execute('''
          CREATE TABLE store_data(
               StoreKey INT,
               StoreCountry TEXT,
               StoreState TEXT,
               StoreSquaremeters FLOAT,
               StoreOpenDate DATE);
               ''')

# Reading data from the CSV file
store = pd.read_csv(r"C:\Users\yuvar\Desktop\Captsone2\cleaned_data\Store_modified.csv")

# Selecting and renaming columns to match the SQL table
data = store[['StoreKey', 'Country', 'State', 'Square Meters', 'Open Date']].values.tolist()

# Inserting the data into the SQL table
cursor.executemany('''
                INSERT INTO store_data (StoreKey, StoreCountry, StoreState, StoreSquaremeters, StoreOpenDate)
                VALUES (%s, %s, %s, %s, %s)''', data)

# Committing the transaction
mydb.commit()

print("done")

# Closing the cursor and connection
cursor.close()
mydb.close()

done

### Sales Data

In [101]:
sl = pd.read_csv("C:\Project_Guvi\Captsone2\DataSet\Sales.csv")
sl.head()

,Order Number,Line Item,Order Date,Delivery Date,CustomerKey,StoreKey,ProductKey,Quantity,Currency Code
0,366000,1,1/1/2016,NaN,265598,10,1304,1,CAD
1,366001,1,1/1/2016,1/13/2016,1269051,0,1048,2,USD
2,366001,2,1/1/2016,1/13/2016,1269051,0,2007,1,USD
3,366002,1,1/1/2016,1/12/2016,266019,0,1106,7,CAD
4,366002,2,1/1/2016,1/12/2016,266019,0,373,1,CAD

In [103]:
sl.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 62884 entries, 0 to 62883
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Order Number   62884 non-null  int64
 1   Line Item      62884 non-null  int64
 2   Order Date     62884 non-null  object
 3   Delivery Date  13165 non-null  object
 4   CustomerKey    62884 non-null  int64
 5   StoreKey       62884 non-null  int64
 6   ProductKey     62884 non-null  int64
 7   Quantity       62884 non-null  int64
 8   Currency Code  62884 non-null  object
dtypes: int64(6), object(3)
memory usage: 4.3+ MB

In [109]:
sl['Order Date'] = pd.to_datetime(sl['Order Date'])
sl['Delivery Date'] = pd.to_datetime(sl['Delivery Date'])

In [111]:
shipping_days = (sl['Delivery Date'] - sl['Order Date'] ).dt.days

In [113]:
mean_delivery_days = round(shipping_days.mean())
mean_delivery_days

5

In [115]:
sl['Delivery Date'] = sl['Delivery Date'].fillna(sl['Order Date'] + pd.to_timedelta(mean_delivery_days,unit = 'd'))

In [117]:
sl.to_csv('Sales_modified.csv', index = False)

In [125]:
import mysql.connector
import pandas as pd

mydb = mysql.connector.connect(
    host="localhost",
    user="root",
    password="Deepa@280624",
    database="damm"
)

cursor = mydb.cursor()

# Creating the table with corrected column names
cursor.execute('''
          CREATE TABLE sales_data(
               OrderNumber INT,
               LineItem INT,
               OrderDate Date,
               DeliveryDate Date,
               CustomerKey INT,
               StoreKey INT,
               ProductKey INT,
               Quantity INT,
               CurrencyCode TEXT);
               ''')

# Reading data from the CSV file
sales = pd.read_csv(r"C:\Users\yuvar\Desktop\Captsone2\cleaned_data\Sales_modified.csv")

# Selecting and renaming columns to match the SQL table
data = sales[['Order Number', 'Line Item', 'Order Date', 'Delivery Date',
       'CustomerKey', 'StoreKey', 'ProductKey', 'Quantity', 'Currency Code']].values.tolist()

# Inserting the data into the SQL table
cursor.executemany('''
                INSERT INTO sales_data (OrderNumber,LineItem,OrderDate,DeliveryDate,CustomerKey,StoreKey,ProductKey,Quantity,CurrencyCode)
                VALUES (%s, %s, %s, %s, %s,%s,%s,%s,%s)''', data)

# Committing the transaction
mydb.commit()

print("done")

# Closing the cursor and connection
cursor.close()
mydb.close()

done